In [1]:
import numpy as np
import pandas as pd

# DataFrame class

In [2]:
# DataFrame은 pandas의 주요 데이터 구조
# label된 row와 column, 두개의 축을 갖는 데이터 구조

# 산술 연산은 row와 column 모두 적용
# Series 객체를 갖는 dictionary와 비슷하다고 여기면 됨

# class pandas.DataFrame(data = None, index = None, columns = None,
#                        dtype = None, copy = None)

# 첫 인자로 data, 두번째 인자로 index를 전달
# DataFrame은 각 column마다 자료형이 다를 수 있다.

# DataFrame 생성

# Series가 1차원 벡터에 행방향 index(row index)를 붙얐다면,
# DataFrame 클래스는 2차원 행렬 데이터에 index를 붙인 것

# row index와 column index 각각의 이름 붙이기 가능

# DataFrame 만드는 방법
# 1. 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비
# 2. 이 각각의 열에 대한 이름(label)을 키로 가지는 딕셔너리 생성
# 3. 이 데이터를 DataFrame 클래스 생성자에 넣는다.
# 동시에 열방향 index는 columns 인수로, 행방향 index는 index인수로 지정

d = {'col1' : [1, 2], 'col2' : [3, 4]}
df = pd.DataFrame(data = d) #클래스 생성자
df

   col1  col2
0     1     3
1     2     4

In [3]:
#1값을 뽑아낼 경우

d = {'col1' : [1, 2], 'col2' : [3, 4]}
df = pd.DataFrame(data = d) #클래스 생성자
df["col1"][0]

1

# DataFrame 생성

In [4]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}

columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"] #row
df = pd.DataFrame(data, index = index, columns = columns)
df

# 아래표 세로로 한줄씩 - 한개의 로우
# data를 columns와 매치 -> key 값 / index만듦 ->index,colums 둘다 키값이 됨

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [5]:
df.dtypes # 각 column별 dtype을 보여준다.

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

## DataFrame의 속성 values, columns, index

In [6]:
#Series와 마찬가지로 데이터만 접근하려면 values 속성을 사용합니다. 
#열방향 index와 행방향 index는 각각 columns, index 속성으로 접근합니다.

#### df.values - 데이터만 접근

In [7]:
df.values # 데이터만 접근

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

#### df.columns - 열 이름 목록 보여주기

In [8]:
df.columns # 열 이름 목록 보여주기

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

#### df.index - 행 이름 목록 보여주기

In [9]:
df.index # 행 이름 목록 보여주기

Index(['서울', '부산', '인천', '대구'], dtype='object')

## DataFrame 이름 붙이기

In [10]:
# DataFrame 이름 붙이기
#Series에서 처럼 열방향 index와 행방향 index에 이름을 붙이는 것도 가능

df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [11]:
#연습문제
#지금부터 인터넷 서핑을 통해 자신이 관심있는 데이터를 얻고, 
#아래 조건을 만족하는 DataFrame을 직접 만들어보세요!

#(1) column의 개수와 row의 개수가 각각 4개 이상이어야 합니다.
#(2) column에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 합니다.

In [12]:
infinite_2nd_album = {
    "곡" : ["season2", "last romeo", "follow me", "로시난테",
          "숨 좀 쉬자","Light","alone","Memories"],
    "작사" : ["-", "송수윤","제이윤","송수윤","송수윤","김성규",
            "장동우, 호야","송수윤"],
    "작곡" : ["YUE", "한재호, 김승수", "제이윤","이창현, 한재호, 김승수",
            "G-High, 이주형","제이윤","Rphabet","한재호, 김승수, YUE"],
    "트랙" : ["01","02","03","04","05","06","07","08"],
}

columns = ["트랙", "곡", "작사", "작곡"]
index = ["01", "02", "03", "04","05","06","07","08"] #row
infinite = pd.DataFrame(infinite_2nd_album, index = index, columns = columns)
infinite

    트랙           곡       작사             작곡
01  01     season2        -            YUE
02  02  last romeo      송수윤       한재호, 김승수
03  03   follow me      제이윤            제이윤
04  04        로시난테      송수윤  이창현, 한재호, 김승수
05  05      숨 좀 쉬자      송수윤    G-High, 이주형
06  06       Light      김성규            제이윤
07  07       alone  장동우, 호야        Rphabet
08  08    Memories      송수윤  한재호, 김승수, YUE

# DataFrame 전치(Transpose)

In [13]:
# DataFrame 전치(Transpose)
#DataFrame은 전치(transpose)를 포함하여 
#넘파이 2차원 배열이 가지는 대부분의 속성이나 메서드를 지원합니다.
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

# DataFrame column 추가, 갱신, 삭제

## DataFrame column 갱신

In [14]:
# "2010-2015 증가율"이라는 이름의 열의 값을 갱신
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

## DataFrame column 추가

In [15]:
## DataFrame column 추가
# "2005-2010 증가율"이라는 이름의 열 추가
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df
#round(_) -> 소수점 _자리까지 반올림

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

## DataFrame column 삭제

In [16]:
## DataFrame column 삭제
# "2010-2015 증가열"이라는 이름의 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

# DataFrame column 인덱싱 종류

In [17]:
# DataFrame column 인덱싱
# index로 label 값을 하나만 넣으면 Series 객체 반환
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [18]:
# index로 label 값을 하나의 column만 넣으면 Series 객체 반환
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [19]:
# label의 배열 또는 리스트로 (여러개의 columns 로)인덱싱하면 DataFrame 타입 반환
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [20]:
# column만 빼내더라도 DataFrame 자료형을 쓰고 싶다면
# 하나의 리스트 자료형을 사용해서 인덱싱하면 된다.
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [21]:
type(df[["2010"]])

pandas.core.frame.DataFrame

### DataFrame column 인덱싱 주의

In [22]:
# DataFrame의 column index가 문자열 label일 때는 순서를 나타내는 정수
# index를 column 인덱싱에 사용할 수 없다.
# column index가 문자열인데 정수 index를 넣으면
# KeyError 오류가 발생

#df[0]

In [23]:
# 원래부터 문자열이 아닌 정수형 column index를 가지는 경우에
# index 값으로 정수 사용 가능
#별도의 columns 키워드 인수를 전달하지 않으면 RangeIndex를 기본 값으로 부여합니다.

df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

# DataFrame row 슬라이싱

In [24]:
# DataFrame row 슬라이싱

# 만약 row 단위로 인덱싱을 하고자 하면
# 항상 슬라이싱(slicing)을 해야 한다.
# index의 값이 문자 label이면 label 슬라이싱도 가능

df #index가 “서울"이자 0 입니다

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [25]:
df[:1] # df[:"서울"] → 끝 범위는 문자는 포함, 숫자는 미포함

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [26]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [27]:
df["부산":"부산"] # 1줄을 보기 위해 다시 부산을 시작값과 끝값 지정

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [28]:
# row단위로 인덱싱을 하면 KeyError 발생

#df["서울"]

In [29]:
# DataFrame 개별 데이터 인덱싱

# DataFrame에서 column label로 인덱싱하면 Series
# 이 Series를 다시 row label로 인덱싱하면 개별 데이터
df["2015"]["서울"] #df(column = Series,row)

9904312

In [30]:
type(df["2015"]["서울"])

numpy.int64

In [31]:
## DataFrame 개별 데이터 인덱싱 순서 배치(column-row가 아닌 row-column)

# row 단위로 먼저 인덱싱하려면 슬라이싱 이후에 해야 해서 비효율적
df["서울":"서울"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [32]:
df["서울":"서울"]["2015"]

도시
서울    9904312
Name: 2015, dtype: int64

In [33]:
type(df["서울":"서울"]["2015"])

pandas.core.series.Series

In [34]:
# DataFrame 인덱싱과 슬라이싱 정리(표 정리하심,,진명님,,,bb)

result = {"가능 여부" : ["O", "O", "X", "O"],
          "결과" : ["열", "열", "", "행"],
          "자료형" : ["Series", "DataFrame", "", "DataFrame"],
          "비고" : ["", "", "column label이 문자인 경우는 불가능하지만 정수인 경우는 가능하다.", ""]
         }

index = ["label", "label list", "index(int)", "slicing(int)"]

result_pd = pd.DataFrame(result, index = index)
result_pd.index.name = "인덱싱 값"
result_pd

             가능 여부 결과        자료형                                          비고
인덱싱 값
label            O  열     Series
label list       O  열  DataFrame
index(int)       X                column label이 문자인 경우는 불가능하지만 정수인 경우는 가능하다.
slicing(int)     O  행  DataFrame

In [35]:
#연습문제

"""
다음 DataFrame을 활용하여 아래 문제를 해결해보세요.
(1) 모든 학생의 수학 점수를 Series로 나타낸다.
(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
(4) 춘향의 점수를 DataFrame으로 나타낸다.
(5) 향단의 점수를 Series로 나타낸다.
"""

data = {
 "국어": [80, 90, 70, 30],
 "영어": [90, 70, 60, 40],
 "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [36]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [37]:
#(1)
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [38]:
#(2)
df[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [39]:
#(3)
df["평균 점수"] = (df["국어"] / 3 + df["영어"] / 3 + df["수학"] /3).round(2) 
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [40]:
#(4)
df[:1]

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67

In [41]:
#(5)
df.T["향단"]

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [42]:
#연습문제2

In [43]:
np.random.seed(0)
values = np.random.randn(6,4)

columns = ["A","B","C","D"] #가로줄 #세로로 읽음
index = pd.date_range("20130226", periods = 6) #세로줄 #가로로 읽음
df = pd.DataFrame(values, index = index, columns = columns)
df

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165